import pytest
import logging
import datetime
from src.utils import transform_date, get_date_range, get_transactions
import os
from config import DATA_DIR
from numpy import nan
from pandas import Timestamp


@pytest.fixture
def date():
    return "20.12.2020"


def test_transform_date(date):
    assert transform_date(date) == datetime.datetime(2020, 12, 20, 0, 0)


@pytest.mark.parametrize(
    "date, range_, dates",
    [
        (
            datetime.datetime(2021, 12, 20, 0, 0),
            "W",
            [
                datetime.datetime(2021, 12, 20, 0, 0),
                datetime.datetime(2021, 12, 20, 23, 59, 59, 999999),
            ],
        ),
        (
            datetime.datetime(2021, 12, 20, 0, 0),
            "M",
            [
                datetime.datetime(2021, 12, 1, 0, 0),
                datetime.datetime(2021, 12, 20, 23, 59, 59, 999999),
            ],
        ),
        (
            datetime.datetime(2021, 1, 20, 0, 0),
            "Y",
            [
                datetime.datetime(2021, 1, 1, 0, 0),
                datetime.datetime(2021, 1, 20, 23, 59, 59, 999999),
            ],
        ),
        (
            datetime.datetime(2021, 12, 20, 0, 0),
            "ALL",
            [
                datetime.datetime(2021, 12, 20, 0, 0),
                datetime.datetime(2021, 12, 31, 23, 59, 59, 999999),
            ],
        ),
    ],
)
def test_get_date_range(date, range_, dates):
    assert get_date_range(date, range_) == dates


@pytest.mark.parametrize(
    "start_date, end_date, path, transactions",
    [
        (
            datetime.datetime(2021, 12, 20, 0, 0),
            datetime.datetime(2021, 12, 22, 23, 59, 59, 999999),
            os.path.join(DATA_DIR, "operations.csv"),
            [
                {
                    "Дата операции": Timestamp("2021-12-20 22:14:18"),
                    "Дата платежа": "21.12.2021",
                    "Номер карты": "*7197",
                    "Статус": "OK",
                    "Сумма операции": "-120,00",
                    "Валюта операции": "RUB",
                    "Сумма платежа": "-120,00",
                    "Валюта платежа": "RUB",
                    "Кэшбэк": nan,
                    "Категория": "Фастфуд",
                    "MCC": 5814.0,
                    "Описание": "ЛюдиЛюбят",
                    "Бонусы (включая кэшбэк)": "2,00",
                    "Округление на инвесткопилку": "0,00",
                    "Сумма операции с округлением": "120,00",
                },
                {
                    "Дата операции": Timestamp("2021-12-20 21:33:24"),
                    "Дата платежа": "21.12.2021",
                    "Номер карты": "*7197",
                    "Статус": "OK",
                    "Сумма операции": "-1400,00",
                    "Валюта операции": "RUB",
                    "Сумма платежа": "-1400,00",
                    "Валюта платежа": "RUB",
                    "Кэшбэк": nan,
                    "Категория": "Дом и ремонт",
                    "MCC": 7699.0,
                    "Описание": "YM*o481",
                    "Бонусы (включая кэшбэк)": "28,00",
                    "Округление на инвесткопилку": "0,00",
                    "Сумма операции с округлением": "1400,00",
                },
                {
                    "Дата операции": Timestamp("2021-12-20 19:42:13"),
                    "Дата платежа": "20.12.2021",
                    "Номер карты": "*7197",
                    "Статус": "OK",
                    "Сумма операции": "421,00",
                    "Валюта операции": "RUB",
                    "Сумма платежа": "421,00",
                    "Валюта платежа": "RUB",
                    "Кэшбэк": nan,
                    "Категория": "Различные товары",
                    "MCC": 5399.0,
                    "Описание": "Ozon.ru",
                    "Бонусы (включая кэшбэк)": "-8,00",
                    "Округление на инвесткопилку": "0,00",
                    "Сумма операции с округлением": "421,00",
                },
                {
                    "Дата операции": Timestamp("2021-12-20 19:40:28"),
                    "Дата платежа": "20.12.2021",
                    "Номер карты": "*5091",
                    "Статус": "OK",
                    "Сумма операции": "232,96",
                    "Валюта операции": "RUB",
                    "Сумма платежа": "232,96",
                    "Валюта платежа": "RUB",
                    "Кэшбэк": nan,
                    "Категория": "Бонусы",
                    "MCC": nan,
                    "Описание": "Выплата по вашему обращению",
                    "Бонусы (включая кэшбэк)": "0,00",
                    "Округление на инвесткопилку": "0,00",
                    "Сумма операции с округлением": "232,96",
                },
                {
                    "Дата операции": Timestamp("2021-12-20 19:35:26"),
                    "Дата платежа": "20.12.2021",
                    "Номер карты": "*5091",
                    "Статус": "OK",
                    "Сумма операции": "495,00",
                    "Валюта операции": "RUB",
                    "Сумма платежа": "495,00",
                    "Валюта платежа": "RUB",
                    "Кэшбэк": nan,
                    "Категория": "Бонусы",
                    "MCC": nan,
                    "Описание": "Выплата по вашему обращению",
                    "Бонусы (включая кэшбэк)": "0,00",
                    "Округление на инвесткопилку": "0,00",
                    "Сумма операции с округлением": "495,00",
                },
                {
                    "Дата операции": Timestamp("2021-12-20 10:19:26"),
                    "Дата платежа": "20.12.2021",
                    "Номер карты": "*7197",
                    "Статус": "OK",
                    "Сумма операции": "-34,00",
                    "Валюта операции": "RUB",
                    "Сумма платежа": "-34,00",
                    "Валюта платежа": "RUB",
                    "Кэшбэк": nan,
                    "Категория": "Фастфуд",
                    "MCC": 5814.0,
                    "Описание": "Rumyanyj Khleb",
                    "Бонусы (включая кэшбэк)": "0,00",
                    "Округление на инвесткопилку": "0,00",
                    "Сумма операции с округлением": "34,00",
                },
                {
                    "Дата операции": Timestamp("2021-12-20 10:09:30"),
                    "Дата платежа": "20.12.2021",
                    "Номер карты": "*7197",
                    "Статус": "OK",
                    "Сумма операции": "-172,69",
                    "Валюта операции": "RUB",
                    "Сумма платежа": "-172,69",
                    "Валюта платежа": "RUB",
                    "Кэшбэк": nan,
                    "Категория": "Супермаркеты",
                    "MCC": 5411.0,
                    "Описание": "Дикси",
                    "Бонусы (включая кэшбэк)": "3,00",
                    "Округление на инвесткопилку": "0,00",
                    "Сумма операции с округлением": "172,69",
                },
            ],
        )
    ],
)
def test_get_transactions(start_date, end_date, path, transactions):
    assert get_transactions(start_date, end_date, path) == transactions
