import datetime
import os
from unittest.mock import patch

import pytest

from config import DATA_DIR
from src.utils import (
    calculate_expenses,
    calculate_incomes,
    get_currency_rates,
    get_date_range,
    get_stocks_prices,
    get_transactions,
    split_transactions,
    transform_date,
)


@pytest.fixture
def date():
    return "2020-12-20 00:00:00"


def test_transform_date(date):
    assert transform_date(date) == datetime.datetime(2020, 12, 20, 0, 0, 0)


@pytest.mark.parametrize(
    "date, range_, dates",
    [
        (
            datetime.datetime(2021, 12, 20, 0, 0, 0),
            "W",
            [
                datetime.datetime(2021, 12, 20, 0, 0, 0),
                datetime.datetime(2021, 12, 20, 23, 59, 59, 999999),
            ],
        ),
        (
            datetime.datetime(2021, 12, 20, 0, 0, 0),
            "M",
            [
                datetime.datetime(2021, 12, 1, 0, 0, 0),
                datetime.datetime(2021, 12, 20, 23, 59, 59, 999999),
            ],
        ),
        (
            datetime.datetime(2021, 1, 20, 0, 0, 0),
            "Y",
            [
                datetime.datetime(2021, 1, 1, 0, 0, 0),
                datetime.datetime(2021, 1, 20, 23, 59, 59, 999999),
            ],
        ),
        (
            datetime.datetime(2021, 12, 20, 0, 0, 0),
            "ALL",
            [
                datetime.datetime(2021, 12, 20, 0, 0, 0),
                datetime.datetime(2021, 12, 31, 23, 59, 59, 999999),
            ],
        ),
    ],
)
def test_get_date_range(date, range_, dates):
    assert get_date_range(date, range_) == dates


@pytest.mark.parametrize(
    "start_date, end_date, path, transactions",
    [
        (
            datetime.datetime(2021, 12, 20, 0, 0, 0),
            datetime.datetime(2021, 12, 20, 23, 59, 59, 999999),
            os.path.join(DATA_DIR, "operations.csv"),
            [
                {
                    "Дата операции": datetime.datetime(2021, 12, 20, 22, 14, 18),
                    "Дата платежа": "21.12.2021",
                    "Номер карты": "*7197",
                    "Статус": "OK",
                    "Сумма операции": "-120,00",
                    "Валюта операции": "RUB",
                    "Сумма платежа": "-120,00",
                    "Валюта платежа": "RUB",
                    "Кэшбэк": None,
                    "Категория": "Фастфуд",
                    "MCC": 5814.0,
                    "Описание": "ЛюдиЛюбят",
                    "Бонусы (включая кэшбэк)": "2,00",
                    "Округление на инвесткопилку": "0,00",
                    "Сумма операции с округлением": "120,00",
                },
                {
                    "Дата операции": datetime.datetime(2021, 12, 20, 21, 33, 24),
                    "Дата платежа": "21.12.2021",
                    "Номер карты": "*7197",
                    "Статус": "OK",
                    "Сумма операции": "-1400,00",
                    "Валюта операции": "RUB",
                    "Сумма платежа": "-1400,00",
                    "Валюта платежа": "RUB",
                    "Кэшбэк": None,
                    "Категория": "Дом и ремонт",
                    "MCC": 7699.0,
                    "Описание": "YM*o481",
                    "Бонусы (включая кэшбэк)": "28,00",
                    "Округление на инвесткопилку": "0,00",
                    "Сумма операции с округлением": "1400,00",
                },
                {
                    "Дата операции": datetime.datetime(2021, 12, 20, 19, 42, 13),
                    "Дата платежа": "20.12.2021",
                    "Номер карты": "*7197",
                    "Статус": "OK",
                    "Сумма операции": "421,00",
                    "Валюта операции": "RUB",
                    "Сумма платежа": "421,00",
                    "Валюта платежа": "RUB",
                    "Кэшбэк": None,
                    "Категория": "Различные товары",
                    "MCC": 5399.0,
                    "Описание": "Ozon.ru",
                    "Бонусы (включая кэшбэк)": "-8,00",
                    "Округление на инвесткопилку": "0,00",
                    "Сумма операции с округлением": "421,00",
                },
                {
                    "Дата операции": datetime.datetime(2021, 12, 20, 19, 40, 28),
                    "Дата платежа": "20.12.2021",
                    "Номер карты": "*5091",
                    "Статус": "OK",
                    "Сумма операции": "232,96",
                    "Валюта операции": "RUB",
                    "Сумма платежа": "232,96",
                    "Валюта платежа": "RUB",
                    "Кэшбэк": None,
                    "Категория": "Бонусы",
                    "MCC": None,
                    "Описание": "Выплата по вашему обращению",
                    "Бонусы (включая кэшбэк)": "0,00",
                    "Округление на инвесткопилку": "0,00",
                    "Сумма операции с округлением": "232,96",
                },
                {
                    "Дата операции": datetime.datetime(2021, 12, 20, 19, 35, 26),
                    "Дата платежа": "20.12.2021",
                    "Номер карты": "*5091",
                    "Статус": "OK",
                    "Сумма операции": "495,00",
                    "Валюта операции": "RUB",
                    "Сумма платежа": "495,00",
                    "Валюта платежа": "RUB",
                    "Кэшбэк": None,
                    "Категория": "Бонусы",
                    "MCC": None,
                    "Описание": "Выплата по вашему обращению",
                    "Бонусы (включая кэшбэк)": "0,00",
                    "Округление на инвесткопилку": "0,00",
                    "Сумма операции с округлением": "495,00",
                },
                {
                    "Дата операции": datetime.datetime(2021, 12, 20, 10, 19, 26),
                    "Дата платежа": "20.12.2021",
                    "Номер карты": "*7197",
                    "Статус": "OK",
                    "Сумма операции": "-34,00",
                    "Валюта операции": "RUB",
                    "Сумма платежа": "-34,00",
                    "Валюта платежа": "RUB",
                    "Кэшбэк": None,
                    "Категория": "Фастфуд",
                    "MCC": 5814.0,
                    "Описание": "Rumyanyj Khleb",
                    "Бонусы (включая кэшбэк)": "0,00",
                    "Округление на инвесткопилку": "0,00",
                    "Сумма операции с округлением": "34,00",
                },
                {
                    "Дата операции": datetime.datetime(2021, 12, 20, 10, 9, 30),
                    "Дата платежа": "20.12.2021",
                    "Номер карты": "*7197",
                    "Статус": "OK",
                    "Сумма операции": "-172,69",
                    "Валюта операции": "RUB",
                    "Сумма платежа": "-172,69",
                    "Валюта платежа": "RUB",
                    "Кэшбэк": None,
                    "Категория": "Супермаркеты",
                    "MCC": 5411.0,
                    "Описание": "Дикси",
                    "Бонусы (включая кэшбэк)": "3,00",
                    "Округление на инвесткопилку": "0,00",
                    "Сумма операции с округлением": "172,69",
                },
            ],
        )
    ],
)
def test_get_transactions(start_date, end_date, path, transactions):
    assert get_transactions(start_date, end_date, path) == transactions


@pytest.fixture
def transactions():
    return [
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 22, 14, 18),
            "Дата платежа": "21.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": "-120,00",
            "Валюта операции": "RUB",
            "Сумма платежа": "-120,00",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "ЛюдиЛюбят",
            "Бонусы (включая кэшбэк)": "2,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "120,00",
        },
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 21, 33, 24),
            "Дата платежа": "21.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": "-1400,00",
            "Валюта операции": "RUB",
            "Сумма платежа": "-1400,00",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Дом и ремонт",
            "MCC": 7699.0,
            "Описание": "YM*o481",
            "Бонусы (включая кэшбэк)": "28,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "1400,00",
        },
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 19, 42, 13),
            "Дата платежа": "20.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": "421,00",
            "Валюта операции": "RUB",
            "Сумма платежа": "421,00",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Различные товары",
            "MCC": 5399.0,
            "Описание": "Ozon.ru",
            "Бонусы (включая кэшбэк)": "-8,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "421,00",
        },
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 19, 40, 28),
            "Дата платежа": "20.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": "232,96",
            "Валюта операции": "RUB",
            "Сумма платежа": "232,96",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Бонусы",
            "MCC": None,
            "Описание": "Выплата по вашему обращению",
            "Бонусы (включая кэшбэк)": "0,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "232,96",
        },
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 19, 35, 26),
            "Дата платежа": "20.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": "495,00",
            "Валюта операции": "RUB",
            "Сумма платежа": "495,00",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Бонусы",
            "MCC": None,
            "Описание": "Выплата по вашему обращению",
            "Бонусы (включая кэшбэк)": "0,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "495,00",
        },
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 10, 19, 26),
            "Дата платежа": "20.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": "-34,00",
            "Валюта операции": "RUB",
            "Сумма платежа": "-34,00",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "Rumyanyj Khleb",
            "Бонусы (включая кэшбэк)": "0,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "34,00",
        },
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 10, 9, 30),
            "Дата платежа": "20.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": "-172,69",
            "Валюта операции": "RUB",
            "Сумма платежа": "-172,69",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Дикси",
            "Бонусы (включая кэшбэк)": "3,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "172,69",
        },
    ]


def test_split_transactions(transactions):
    expected_list_1 = [
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 19, 42, 13),
            "Дата платежа": "20.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": 421.0,
            "Валюта операции": "RUB",
            "Сумма платежа": "421,00",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Различные товары",
            "MCC": 5399.0,
            "Описание": "Ozon.ru",
            "Бонусы (включая кэшбэк)": "-8,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "421,00",
        },
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 19, 40, 28),
            "Дата платежа": "20.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": 232.96,
            "Валюта операции": "RUB",
            "Сумма платежа": "232,96",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Бонусы",
            "MCC": None,
            "Описание": "Выплата по вашему обращению",
            "Бонусы (включая кэшбэк)": "0,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "232,96",
        },
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 19, 35, 26),
            "Дата платежа": "20.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": 495.0,
            "Валюта операции": "RUB",
            "Сумма платежа": "495,00",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Бонусы",
            "MCC": None,
            "Описание": "Выплата по вашему обращению",
            "Бонусы (включая кэшбэк)": "0,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "495,00",
        },
    ]
    expected_list_2 = [
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 22, 14, 18),
            "Дата платежа": "21.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -120.0,
            "Валюта операции": "RUB",
            "Сумма платежа": "-120,00",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "ЛюдиЛюбят",
            "Бонусы (включая кэшбэк)": "2,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "120,00",
        },
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 21, 33, 24),
            "Дата платежа": "21.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -1400.0,
            "Валюта операции": "RUB",
            "Сумма платежа": "-1400,00",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Дом и ремонт",
            "MCC": 7699.0,
            "Описание": "YM*o481",
            "Бонусы (включая кэшбэк)": "28,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "1400,00",
        },
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 10, 19, 26),
            "Дата платежа": "20.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -34.0,
            "Валюта операции": "RUB",
            "Сумма платежа": "-34,00",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "Rumyanyj Khleb",
            "Бонусы (включая кэшбэк)": "0,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "34,00",
        },
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 10, 9, 30),
            "Дата платежа": "20.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -172.69,
            "Валюта операции": "RUB",
            "Сумма платежа": "-172,69",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Дикси",
            "Бонусы (включая кэшбэк)": "3,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "172,69",
        },
    ]

    result_1, result_2 = split_transactions(transactions)
    assert result_1 == expected_list_1
    assert result_2 == expected_list_2


@pytest.fixture
def incomes():
    return [
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 19, 42, 13),
            "Дата платежа": "20.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": 421.0,
            "Валюта операции": "RUB",
            "Сумма платежа": "421,00",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Различные товары",
            "MCC": 5399.0,
            "Описание": "Ozon.ru",
            "Бонусы (включая кэшбэк)": "-8,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "421,00",
        },
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 19, 40, 28),
            "Дата платежа": "20.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": 232.96,
            "Валюта операции": "RUB",
            "Сумма платежа": "232,96",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Бонусы",
            "MCC": None,
            "Описание": "Выплата по вашему обращению",
            "Бонусы (включая кэшбэк)": "0,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "232,96",
        },
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 19, 35, 26),
            "Дата платежа": "20.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": 495.0,
            "Валюта операции": "RUB",
            "Сумма платежа": "495,00",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Бонусы",
            "MCC": None,
            "Описание": "Выплата по вашему обращению",
            "Бонусы (включая кэшбэк)": "0,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "495,00",
        },
    ]


@pytest.fixture
def expenses():
    return [
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 22, 14, 18),
            "Дата платежа": "21.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -120.0,
            "Валюта операции": "RUB",
            "Сумма платежа": "-120,00",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "ЛюдиЛюбят",
            "Бонусы (включая кэшбэк)": "2,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "120,00",
        },
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 21, 33, 24),
            "Дата платежа": "21.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -1400.0,
            "Валюта операции": "RUB",
            "Сумма платежа": "-1400,00",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Дом и ремонт",
            "MCC": 7699.0,
            "Описание": "YM*o481",
            "Бонусы (включая кэшбэк)": "28,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "1400,00",
        },
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 10, 19, 26),
            "Дата платежа": "20.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -34.0,
            "Валюта операции": "RUB",
            "Сумма платежа": "-34,00",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "Rumyanyj Khleb",
            "Бонусы (включая кэшбэк)": "0,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "34,00",
        },
        {
            "Дата операции": datetime.datetime(2021, 12, 20, 10, 9, 30),
            "Дата платежа": "20.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -172.69,
            "Валюта операции": "RUB",
            "Сумма платежа": "-172,69",
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Дикси",
            "Бонусы (включая кэшбэк)": "3,00",
            "Округление на инвесткопилку": "0,00",
            "Сумма операции с округлением": "172,69",
        },
    ]


def test_calculate_incomes(incomes):
    assert calculate_incomes(incomes) == {
        "total_amount": 1148.96,
        "main": [{"category": "Бонусы", "amount": 727.96}, {"category": "Различные товары", "amount": 421.0}],
    }


def test_calculate_expenses(expenses):
    assert calculate_expenses(expenses) == {
        "total_amount": 1726.69,
        "main": [
            {"category": "Дом и ремонт", "amount": 1400.0},
            {"category": "Супермаркеты", "amount": 172.69},
            {"category": "Фастфуд", "amount": 154.0},
        ],
        "transfers_and_cash": [],
    }


@pytest.fixture
def path_user_settings_test():
    return os.path.join(DATA_DIR, "user_settings_test.json")


@patch("requests.get")
def test_get_currency_rates(mock_get, path_user_settings_test):
    mock_get.return_value.json.return_value = {
        "success": True,
        "timestamp": 1752695345,
        "base": "EUR",
        "date": "2025-07-16",
        "rates": {"RUB": 91.04},
    }
    result = get_currency_rates(path_user_settings_test)
    assert result == [
        {"currency": "EUR", "rate": 91.04},
        {"currency": "USD", "rate": 91.04},
    ]  # для упрощения функции курсы сделаны одинаковыми
    assert mock_get.call_count == 2


@patch("requests.get")
def test_get_stock_prices(mock_get, path_user_settings_test):
    mock_get.return_value.json.return_value = {"price": "223.4"}
    result = get_stocks_prices(path_user_settings_test)
    assert result == [
        {"stock": "AMZN", "price": 223.4},
        {"stock": "GOOGL", "price": 223.4},
    ]
    assert mock_get.call_count == 2
